-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3307
-- Generation Time: Sep 15, 2026 at 11:46 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `testts`
--

-- --------------------------------------------------------

--
-- Table structure for table `acl`
--

CREATE TABLE `acl` (
  `id` int(11) NOT NULL,
  `ugid` int(11) DEFAULT NULL,
  `appid` int(11) DEFAULT NULL,
  `acclevel` tinyint(4) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `acl`
--

INSERT INTO `acl` (`id`, `ugid`, `appid`, `acclevel`, `status`) VALUES
(1, 1, 1, 2, NULL),
(2, 1, 2, 2, NULL),
(3, 1, 3, 2, NULL),
(5, 1, 5, 2, NULL),
(8, 1, 4, 2, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `application`
--

CREATE TABLE `application` (
  `id` int(11) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `dir` varchar(50) DEFAULT NULL,
  `detail` text DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `application`
--

INSERT INTO `application` (`id`, `name`, `dir`, `detail`, `status`) VALUES
(1, 'การจัดการผู้ใช้งานในระบบ', 'UserManagement', NULL, 1),
(2, 'การจัดการกลุ่มผู้ใช้', 'GroupManagement', NULL, 1),
(3, 'การจัดการแอปพิเคชั่น', 'AppManagement', NULL, 1),
(4, 'การจัดการคลื่นเสียง', 'MusicManagement', NULL, 1),
(5, 'การจัดการตัวกรอง', 'FilterManagement', NULL, 1);

-- --------------------------------------------------------

--
-- Table structure for table `assessment`
--

CREATE TABLE `assessment` (
  `id` int(11) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `current_mood` tinyint(4) DEFAULT NULL,
  `energy_level` tinyint(4) DEFAULT NULL,
  `stress_level` tinyint(4) DEFAULT NULL,
  `objective` tinyint(4) DEFAULT NULL,
  `music_type` varchar(50) DEFAULT NULL,
  `duration` int(11) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `assessment_detail`
--

CREATE TABLE `assessment_detail` (
  `id` int(11) NOT NULL,
  `assessid` int(11) DEFAULT NULL,
  `historyid` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `id` int(11) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`id`, `name`, `status`) VALUES
(1, 'ประเภทคลื่น', 1),
(2, 'อารมณ์', 1);

-- --------------------------------------------------------

--
-- Table structure for table `cat_detail`
--

CREATE TABLE `cat_detail` (
  `id` int(11) NOT NULL,
  `category_id` int(11) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `cat_detail`
--

INSERT INTO `cat_detail` (`id`, `category_id`, `name`, `status`) VALUES
(22, 1, 'Delta Wave(0.5-4 Hz)', 1),
(23, 1, 'Theta Wave(4-8 Hz)', 1),
(24, 1, 'Alpla Wave(8-12 Hz)', 1),
(25, 1, 'Beta Wave(12-30 Hz)', 1),
(26, 2, 'นอนหลับ', 1),
(27, 2, 'เพิ่มสมาธิและโฟกัส', 1),
(28, 1, 'Gamma Wave(30-100 Hz)', 1),
(29, 2, 'ปรับอารมณ์ให้ดีขึ้น', 1),
(30, 2, 'ผ่อนคลายทั่วไป', 1),
(31, 2, 'ลดความเครียด', 1);

-- --------------------------------------------------------

--
-- Table structure for table `cat_music`
--

CREATE TABLE `cat_music` (
  `id` int(11) NOT NULL,
  `musicid` int(11) DEFAULT NULL,
  `catdetail_id` int(11) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `cat_music`
--

INSERT INTO `cat_music` (`id`, `musicid`, `catdetail_id`, `status`) VALUES
(13, 2, 22, 1),
(14, 2, 26, 1),
(15, 3, 22, 1),
(16, 3, 26, 1),
(21, 1, 22, 1),
(25, 4, 22, 1),
(26, 4, 26, 1),
(27, 5, 22, 1),
(28, 5, 26, 1),
(30, 6, 22, 1),
(31, 6, 26, 1),
(32, 7, 22, 1),
(33, 7, 26, 1),
(34, 8, 22, 1),
(35, 8, 26, 1),
(36, 9, 22, 1),
(37, 9, 26, 1),
(38, 10, 22, 1),
(39, 10, 26, 1),
(40, 11, 22, 1),
(41, 11, 26, 1),
(42, 12, 22, 1),
(43, 12, 26, 1),
(44, 13, 22, 1),
(45, 13, 26, 1),
(46, 14, 22, 1),
(47, 14, 26, 1),
(48, 15, 22, 1),
(49, 15, 26, 1),
(50, 16, 23, 1),
(51, 16, 26, 1),
(52, 17, 23, 1),
(53, 17, 26, 1),
(54, 18, 23, 1),
(55, 18, 26, 1),
(56, 19, 22, 1),
(57, 19, 26, 1),
(58, 20, 22, 1),
(59, 20, 26, 1),
(61, 1, 26, 1),
(62, 21, 22, 1),
(63, 21, 26, 1),
(64, 22, 22, 1),
(65, 22, 26, 1),
(66, 23, 22, 1),
(67, 23, 26, 1),
(68, 24, 22, 1),
(69, 24, 26, 1),
(70, 25, 23, 1),
(71, 25, 26, 1),
(72, 26, 23, 1),
(73, 26, 26, 1),
(74, 27, 23, 1),
(75, 27, 26, 1),
(76, 28, 23, 1),
(77, 28, 26, 1),
(78, 29, 22, 1),
(79, 29, 26, 1),
(80, 30, 22, 1),
(81, 30, 26, 1),
(82, 31, 28, 1),
(83, 31, 27, 1),
(84, 32, 28, 1),
(85, 32, 27, 1),
(86, 33, 28, 1),
(87, 33, 27, 1),
(88, 34, 28, 1),
(89, 34, 27, 1),
(90, 35, 28, 1),
(91, 35, 27, 1),
(92, 36, 28, 1),
(93, 36, 27, 1),
(94, 37, 28, 1),
(95, 37, 27, 1),
(96, 38, 28, 1),
(97, 38, 27, 1),
(98, 39, 28, 1),
(99, 39, 27, 1),
(100, 40, 28, 1),
(101, 40, 27, 1),
(102, 41, 25, 1),
(103, 41, 27, 1),
(104, 42, 28, 1),
(105, 42, 27, 1),
(106, 43, 25, 1),
(107, 43, 27, 1),
(108, 44, 25, 1),
(109, 44, 27, 1),
(110, 45, 25, 1),
(111, 45, 27, 1),
(112, 46, 25, 1),
(113, 46, 27, 1),
(114, 47, 25, 1),
(115, 47, 27, 1),
(116, 48, 25, 1),
(117, 48, 27, 1),
(118, 49, 25, 1),
(119, 49, 27, 1),
(120, 49, 29, 1),
(121, 50, 25, 1),
(122, 50, 27, 1),
(123, 51, 25, 1),
(124, 51, 27, 1),
(125, 51, 29, 1),
(126, 52, 25, 1),
(127, 52, 27, 1),
(128, 53, 25, 1),
(129, 53, 27, 1),
(130, 54, 25, 1),
(131, 54, 27, 1),
(132, 55, 25, 1),
(133, 55, 27, 1),
(134, 56, 25, 1),
(135, 56, 27, 1),
(136, 57, 25, 1),
(137, 57, 27, 1),
(138, 58, 25, 1),
(139, 58, 27, 1),
(140, 59, 28, 1),
(141, 59, 27, 1),
(142, 60, 25, 1),
(143, 60, 27, 1),
(144, 60, 29, 1),
(145, 61, 24, 1),
(146, 61, 29, 1),
(147, 62, 24, 1),
(148, 62, 29, 1),
(149, 62, 30, 1),
(150, 63, 25, 1),
(151, 63, 29, 1),
(152, 64, 25, 1),
(153, 64, 29, 1),
(154, 65, 25, 1),
(155, 65, 29, 1),
(156, 66, 24, 1),
(157, 66, 29, 1),
(158, 66, 30, 1),
(159, 67, 24, 1),
(160, 67, 29, 1),
(161, 68, 24, 1),
(162, 68, 29, 1),
(163, 69, 24, 1),
(164, 69, 29, 1),
(165, 70, 24, 1),
(166, 70, 29, 1),
(167, 71, 24, 1),
(168, 71, 29, 1),
(169, 71, 30, 1),
(170, 72, 24, 1),
(171, 72, 29, 1),
(172, 73, 24, 1),
(173, 73, 29, 1),
(174, 73, 30, 1),
(175, 74, 24, 1),
(176, 74, 29, 1),
(177, 74, 30, 1),
(178, 75, 24, 1),
(179, 75, 29, 1),
(180, 76, 24, 1),
(181, 76, 29, 1),
(182, 77, 24, 1),
(183, 77, 29, 1),
(184, 78, 24, 1),
(185, 78, 29, 1),
(186, 79, 24, 1),
(187, 79, 29, 1),
(188, 80, 24, 1),
(189, 80, 29, 1),
(190, 81, 24, 1),
(191, 81, 29, 1),
(192, 82, 24, 1),
(193, 82, 29, 1),
(194, 83, 24, 1),
(195, 83, 29, 1),
(196, 84, 24, 1),
(197, 84, 29, 1),
(198, 84, 30, 1),
(199, 85, 24, 1),
(200, 85, 29, 1),
(201, 85, 30, 1),
(202, 86, 24, 1),
(203, 86, 29, 1),
(204, 86, 30, 1),
(205, 87, 25, 1),
(206, 87, 29, 1),
(207, 88, 25, 1),
(208, 88, 29, 1),
(209, 89, 25, 1),
(210, 89, 29, 1),
(211, 90, 25, 1),
(212, 90, 29, 1),
(213, 91, 24, 1),
(214, 91, 29, 1),
(215, 91, 30, 1),
(216, 92, 24, 1),
(217, 92, 30, 1),
(218, 93, 24, 1),
(219, 93, 29, 1),
(220, 93, 30, 1),
(221, 94, 24, 1),
(222, 94, 30, 1),
(223, 95, 24, 1),
(224, 95, 30, 1),
(225, 96, 24, 1),
(226, 96, 30, 1),
(227, 97, 24, 1),
(228, 97, 30, 1),
(229, 98, 24, 1),
(230, 98, 30, 1),
(231, 99, 24, 1),
(232, 99, 30, 1),
(233, 100, 24, 1),
(234, 100, 30, 1),
(235, 101, 24, 1),
(236, 101, 30, 1),
(237, 102, 24, 1),
(238, 102, 30, 1),
(239, 103, 24, 1),
(240, 103, 30, 1),
(241, 104, 24, 1),
(242, 104, 30, 1),
(243, 105, 24, 1),
(244, 105, 30, 1),
(245, 106, 24, 1),
(246, 106, 30, 1),
(247, 107, 24, 1),
(248, 107, 30, 1),
(249, 108, 24, 1),
(250, 108, 30, 1),
(251, 109, 24, 1),
(252, 109, 29, 1),
(253, 109, 30, 1),
(254, 110, 24, 1),
(255, 110, 29, 1),
(256, 110, 30, 1),
(257, 111, 24, 1),
(258, 111, 30, 1),
(259, 112, 24, 1),
(260, 112, 30, 1),
(261, 113, 24, 1),
(262, 113, 29, 1),
(263, 113, 30, 1),
(264, 114, 24, 1),
(265, 114, 30, 1),
(266, 115, 24, 1),
(267, 115, 30, 1),
(268, 115, 31, 1),
(269, 116, 24, 1),
(270, 116, 30, 1),
(271, 117, 24, 1),
(272, 117, 30, 1),
(273, 118, 24, 1),
(274, 118, 30, 1),
(275, 119, 24, 1),
(276, 119, 26, 1),
(277, 119, 30, 1),
(278, 120, 24, 1),
(280, 120, 30, 1),
(281, 121, 24, 1),
(282, 121, 31, 1),
(283, 122, 24, 1),
(284, 122, 31, 1),
(285, 123, 24, 1),
(286, 123, 31, 1),
(287, 124, 24, 1),
(288, 124, 31, 1),
(289, 125, 24, 1),
(290, 125, 31, 1),
(291, 126, 24, 1),
(292, 126, 31, 1),
(293, 127, 24, 1),
(294, 127, 31, 1),
(295, 128, 24, 1),
(296, 128, 31, 1),
(297, 129, 24, 1),
(298, 129, 31, 1),
(299, 130, 24, 1),
(300, 130, 31, 1),
(301, 131, 24, 1),
(302, 131, 31, 1),
(303, 132, 24, 1),
(304, 132, 31, 1),
(305, 133, 24, 1),
(306, 133, 31, 1),
(307, 134, 24, 1),
(308, 134, 30, 1),
(309, 134, 31, 1),
(310, 135, 24, 1),
(311, 135, 30, 1),
(312, 135, 31, 1),
(313, 136, 24, 1),
(314, 136, 31, 1),
(315, 137, 24, 1),
(316, 137, 31, 1),
(317, 138, 24, 1),
(318, 138, 31, 1),
(319, 139, 24, 1),
(320, 139, 31, 1),
(321, 140, 24, 1),
(322, 140, 31, 1),
(323, 141, 24, 1),
(326, 141, 31, 1),
(327, 142, 24, 1),
(328, 142, 31, 1),
(329, 143, 24, 1),
(330, 143, 31, 1),
(331, 144, 24, 1),
(332, 144, 31, 1),
(333, 145, 24, 1),
(334, 145, 31, 1),
(335, 146, 24, 1),
(336, 146, 31, 1),
(337, 147, 24, 1),
(338, 147, 31, 1),
(339, 148, 24, 1),
(340, 148, 30, 1),
(341, 148, 31, 1),
(342, 149, 24, 1),
(343, 149, 31, 1),
(344, 150, 24, 1),
(345, 150, 31, 1);

-- --------------------------------------------------------

--
-- Table structure for table `history`
--

CREATE TABLE `history` (
  `id` int(11) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `musicid` int(11) DEFAULT NULL,
  `play_duration` int(11) DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `log`
--

CREATE TABLE `log` (
  `id` int(11) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `action` varchar(50) NOT NULL,
  `module` varchar(50) DEFAULT NULL,
  `endpoint` varchar(255) NOT NULL,
  `ip_address` varchar(50) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `log`
--

INSERT INTO `log` (`id`, `uid`, `action`, `module`, `endpoint`, `ip_address`, `date`) VALUES
(4, 1, 'บันทึกข้อมูลคลื่นเสียงที่1', NULL, 'http://127.0.0.1:8000/music/save/1', '127.0.0.1', '2026-04-29 18:35:16'),
(5, 1, 'บันทึกข้อมูลคลื่นเสียงที่1', NULL, 'http://127.0.0.1:8000/music/save/1', '127.0.0.1', '2026-04-29 18:38:16'),
(6, 1, 'บันทึกข้อมูลคลื่นเสียงที่4', NULL, 'http://127.0.0.1:8000/music/save/4', '127.0.0.1', '2026-04-29 18:49:10'),
(7, 1, 'บันทึกข้อมูลคลื่นเสียงที่6', NULL, 'http://127.0.0.1:8000/music/save', '127.0.0.1', '2026-04-29 20:13:36'),
(8, 1, 'บันทึกข้อมูลคลื่นเสียงที่7', NULL, 'http://127.0.0.1:8000/music/save', '127.0.0.1', '2026-04-29 20:14:27'),
(9, 1, 'บันทึกข้อมูลคลื่นเสียงที่6', NULL, 'http://127.0.0.1:8000/music/save/6', '127.0.0.1', '2026-04-29 20:20:31'),
(10, 1, 'บันทึกข้อมูลคลื่นเสียงที่7', NULL, 'http://127.0.0.1:8000/music/save/7', '127.0.0.1', '2026-04-29 20:21:08'),
(11, 1, 'บันทึกข้อมูลคลื่นเสียงที่3', NULL, 'http://127.0.0.1:8000/music/save/3', '127.0.0.1', '2026-04-29 20:32:14'),
(12, 1, 'บันทึกข้อมูลคลื่นเสียงที่8', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:11:19'),
(13, 1, 'บันทึกข้อมูลคลื่นเสียงที่9', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:12:47'),
(14, 1, 'บันทึกข้อมูลคลื่นเสียงที่10', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:25:40'),
(15, 1, 'บันทึกข้อมูลคลื่นเสียงที่11', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:28:28'),
(16, 1, 'บันทึกข้อมูลคลื่นเสียงที่12', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:29:19'),
(17, 1, 'บันทึกข้อมูลคลื่นเสียงที่13', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:30:08'),
(18, 1, 'บันทึกข้อมูลคลื่นเสียงที่14', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:30:59'),
(19, 1, 'บันทึกข้อมูลคลื่นเสียงที่15', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:31:40'),
(20, 1, 'บันทึกข้อมูลคลื่นเสียงที่16', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:35:14'),
(21, 1, 'บันทึกข้อมูลคลื่นเสียงที่17', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:36:00'),
(22, 1, 'บันทึกข้อมูลคลื่นเสียงที่18', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:36:42'),
(23, 1, 'บันทึกข้อมูลคลื่นเสียงที่19', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 18:37:49'),
(24, 1, 'บันทึกข้อมูลคลื่นเสียงที่20', NULL, 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-03 19:23:07'),
(26, NULL, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-04 19:47:26'),
(27, NULL, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-04 19:48:35'),
(28, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-04 19:51:23'),
(29, 1, 'In Activeคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-04 20:40:50'),
(30, 1, 'Activeคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-04 20:40:53'),
(31, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-04 20:41:48'),
(32, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-04 20:41:50'),
(33, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-07 22:06:20'),
(34, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-07 22:07:55'),
(35, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-07 22:59:59'),
(36, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-07 23:19:19'),
(37, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-05-07 23:19:23'),
(38, 1, 'เพิ่มคลื่นเสียงที่ 21', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:45:32'),
(39, 1, 'เพิ่มคลื่นเสียงที่ 22', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:46:17'),
(40, 1, 'เพิ่มคลื่นเสียงที่ 23', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:47:02'),
(41, 1, 'เพิ่มคลื่นเสียงที่ 24', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:47:23'),
(42, 1, 'เพิ่มคลื่นเสียงที่ 25', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:47:45'),
(43, 1, 'เพิ่มคลื่นเสียงที่ 26', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:48:54'),
(44, 1, 'เพิ่มคลื่นเสียงที่ 27', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:49:34'),
(45, 1, 'เพิ่มคลื่นเสียงที่ 28', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:50:04'),
(46, 1, 'เพิ่มคลื่นเสียงที่ 29', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:50:42'),
(47, 1, 'เพิ่มคลื่นเสียงที่ 30', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:51:40'),
(48, 1, 'เพิ่มคลื่นเสียงที่ 31', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:57:50'),
(49, 1, 'เพิ่มคลื่นเสียงที่ 32', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:58:22'),
(50, 1, 'เพิ่มคลื่นเสียงที่ 33', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:59:24'),
(51, 1, 'เพิ่มคลื่นเสียงที่ 34', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 15:59:49'),
(52, 1, 'เพิ่มคลื่นเสียงที่ 35', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:00:14'),
(53, 1, 'เพิ่มคลื่นเสียงที่ 36', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:00:40'),
(54, 1, 'เพิ่มคลื่นเสียงที่ 37', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:01:06'),
(55, 1, 'เพิ่มคลื่นเสียงที่ 38', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:01:24'),
(56, 1, 'เพิ่มคลื่นเสียงที่ 39', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:01:47'),
(57, 1, 'เพิ่มคลื่นเสียงที่ 40', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:02:15'),
(58, 1, 'เพิ่มคลื่นเสียงที่ 41', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:05:40'),
(59, 1, 'เพิ่มคลื่นเสียงที่ 42', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:06:08'),
(60, 1, 'เพิ่มคลื่นเสียงที่ 43', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:06:46'),
(61, 1, 'เพิ่มคลื่นเสียงที่ 44', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:07:33'),
(62, 1, 'เพิ่มคลื่นเสียงที่ 45', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:08:12'),
(63, 1, 'เพิ่มคลื่นเสียงที่ 46', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:08:42'),
(64, 1, 'เพิ่มคลื่นเสียงที่ 47', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:09:24'),
(65, 1, 'เพิ่มคลื่นเสียงที่ 48', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:09:46'),
(66, 1, 'เพิ่มคลื่นเสียงที่ 49', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:10:48'),
(67, 1, 'เพิ่มคลื่นเสียงที่ 50', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 16:11:52'),
(68, 1, 'เพิ่มคลื่นเสียงที่ 51', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 17:10:04'),
(69, 1, 'เพิ่มคลื่นเสียงที่ 52', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 17:21:08'),
(70, 1, 'เพิ่มคลื่นเสียงที่ 53', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 17:21:58'),
(71, 1, 'เพิ่มคลื่นเสียงที่ 54', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 17:31:23'),
(72, 1, 'เพิ่มคลื่นเสียงที่ 55', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 17:32:20'),
(73, 1, 'เพิ่มคลื่นเสียงที่ 56', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 17:48:10'),
(74, 1, 'เพิ่มคลื่นเสียงที่ 57', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 17:48:42'),
(75, 1, 'แก้ไขคลื่นเสียงที่ 57', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/57', '127.0.0.1', '2026-05-08 18:05:12'),
(76, 1, 'เพิ่มคลื่นเสียงที่ 58', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 18:34:05'),
(77, 1, 'เพิ่มคลื่นเสียงที่ 59', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 18:34:48'),
(78, 1, 'เพิ่มคลื่นเสียงที่ 60', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-05-08 18:35:39'),
(79, 1, 'แก้ไขคลื่นเสียงเพลย์ลิสต์ที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/playlist/update/1', '127.0.0.1', '2026-05-22 20:40:00'),
(80, 1, 'แก้ไขคลื่นเสียงเพลย์ลิสต์ที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/playlist/update/1', '127.0.0.1', '2026-05-22 21:56:27'),
(81, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 20:34:44'),
(82, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 20:34:58'),
(83, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 20:45:20'),
(84, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 20:57:37'),
(85, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:04:31'),
(86, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:04:54'),
(87, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:07:02'),
(88, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:07:38'),
(89, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:07:51'),
(90, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:12:58'),
(91, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:13:09'),
(92, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-24 21:13:13'),
(93, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-25 22:17:20'),
(94, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-25 22:17:40'),
(95, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-25 22:17:52'),
(96, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-25 22:18:11'),
(97, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-26 17:46:42'),
(98, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-05-26 17:46:45'),
(99, 1, 'แก้ไขเพลย์ลิสต์ที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/playlist/save/1', '127.0.0.1', '2026-05-26 22:08:47'),
(100, 1, 'เพิ่มคลื่นเสียงที่ 61', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 15:57:30'),
(101, 1, 'เพิ่มคลื่นเสียงที่ 62', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:00:37'),
(102, 1, 'เพิ่มคลื่นเสียงที่ 63', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:04:51'),
(103, 1, 'เพิ่มคลื่นเสียงที่ 64', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:06:44'),
(104, 1, 'เพิ่มคลื่นเสียงที่ 65', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:10:22'),
(105, 1, 'เพิ่มคลื่นเสียงที่ 66', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:14:07'),
(106, 1, 'เพิ่มคลื่นเสียงที่ 67', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:14:38'),
(107, 1, 'เพิ่มคลื่นเสียงที่ 68', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:18:13'),
(108, 1, 'เพิ่มคลื่นเสียงที่ 69', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:19:18'),
(109, 1, 'เพิ่มคลื่นเสียงที่ 70', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:24:12'),
(110, 1, 'เพิ่มคลื่นเสียงที่ 71', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:26:53'),
(111, 1, 'เพิ่มคลื่นเสียงที่ 72', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:27:43'),
(112, 1, 'เพิ่มคลื่นเสียงที่ 73', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:28:35'),
(113, 1, 'เพิ่มคลื่นเสียงที่ 74', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:40:07'),
(114, 1, 'เพิ่มคลื่นเสียงที่ 75', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:40:53'),
(115, 1, 'เพิ่มคลื่นเสียงที่ 76', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:44:41'),
(116, 1, 'เพิ่มคลื่นเสียงที่ 77', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:45:31'),
(117, 1, 'เพิ่มคลื่นเสียงที่ 78', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:46:19'),
(118, 1, 'เพิ่มคลื่นเสียงที่ 79', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:47:11'),
(119, 1, 'เพิ่มคลื่นเสียงที่ 80', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:47:48'),
(120, 1, 'เพิ่มคลื่นเสียงที่ 81', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 16:56:37'),
(121, 1, 'เพิ่มคลื่นเสียงที่ 82', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:01:35'),
(122, 1, 'เพิ่มคลื่นเสียงที่ 83', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:02:17'),
(123, 1, 'เพิ่มคลื่นเสียงที่ 84', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:02:51'),
(124, 1, 'เพิ่มคลื่นเสียงที่ 85', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:03:28'),
(125, 1, 'เพิ่มคลื่นเสียงที่ 86', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:06:23'),
(126, 1, 'เพิ่มคลื่นเสียงที่ 87', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:07:26'),
(127, 1, 'เพิ่มคลื่นเสียงที่ 88', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:09:26'),
(128, 1, 'เพิ่มคลื่นเสียงที่ 89', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:10:45'),
(129, 1, 'เพิ่มคลื่นเสียงที่ 90', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:11:34'),
(130, 1, 'เพิ่มคลื่นเสียงที่ 91', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:17:19'),
(131, 1, 'เพิ่มคลื่นเสียงที่ 92', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:25:17'),
(132, 1, 'เพิ่มคลื่นเสียงที่ 93', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:25:50'),
(133, 1, 'เพิ่มคลื่นเสียงที่ 94', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:26:37'),
(134, 1, 'เพิ่มคลื่นเสียงที่ 95', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:27:05'),
(135, 1, 'เพิ่มคลื่นเสียงที่ 96', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:29:33'),
(136, 1, 'เพิ่มคลื่นเสียงที่ 97', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:29:57'),
(137, 1, 'เพิ่มคลื่นเสียงที่ 98', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:30:29'),
(138, 1, 'เพิ่มคลื่นเสียงที่ 99', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:30:56'),
(139, 1, 'เพิ่มคลื่นเสียงที่ 100', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:31:33'),
(140, 1, 'เพิ่มคลื่นเสียงที่ 101', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:34:10'),
(141, 1, 'เพิ่มคลื่นเสียงที่ 102', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:34:42'),
(142, 1, 'เพิ่มคลื่นเสียงที่ 103', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:37:15'),
(143, 1, 'เพิ่มคลื่นเสียงที่ 104', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:37:40'),
(144, 1, 'เพิ่มคลื่นเสียงที่ 105', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:38:09'),
(145, 1, 'เพิ่มคลื่นเสียงที่ 106', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:39:18'),
(146, 1, 'เพิ่มคลื่นเสียงที่ 107', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:40:29'),
(147, 1, 'เพิ่มคลื่นเสียงที่ 108', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:40:54'),
(148, 1, 'เพิ่มคลื่นเสียงที่ 109', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:41:22'),
(149, 1, 'เพิ่มคลื่นเสียงที่ 110', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:41:47'),
(150, 1, 'เพิ่มคลื่นเสียงที่ 111', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:43:19'),
(151, 1, 'เพิ่มคลื่นเสียงที่ 112', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:43:52'),
(152, 1, 'เพิ่มคลื่นเสียงที่ 113', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:45:00'),
(153, 1, 'เพิ่มคลื่นเสียงที่ 114', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:45:30'),
(154, 1, 'เพิ่มคลื่นเสียงที่ 115', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:46:15'),
(155, 1, 'เพิ่มคลื่นเสียงที่ 116', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:48:24'),
(156, 1, 'เพิ่มคลื่นเสียงที่ 117', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:48:53'),
(157, 1, 'เพิ่มคลื่นเสียงที่ 118', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:49:25'),
(158, 1, 'เพิ่มคลื่นเสียงที่ 119', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:49:55'),
(159, 1, 'เพิ่มคลื่นเสียงที่ 120', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:50:31'),
(160, 1, 'แก้ไขคลื่นเสียงที่ 120', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/120', '127.0.0.1', '2026-09-01 17:50:48'),
(161, 1, 'เพิ่มคลื่นเสียงที่ 121', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:52:24'),
(162, 1, 'เพิ่มคลื่นเสียงที่ 122', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:52:43'),
(163, 1, 'เพิ่มคลื่นเสียงที่ 123', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:53:06'),
(164, 1, 'เพิ่มคลื่นเสียงที่ 124', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:53:27'),
(165, 1, 'เพิ่มคลื่นเสียงที่ 125', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:53:54'),
(166, 1, 'เพิ่มคลื่นเสียงที่ 126', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:55:12'),
(167, 1, 'เพิ่มคลื่นเสียงที่ 127', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:55:37'),
(168, 1, 'เพิ่มคลื่นเสียงที่ 128', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:55:56'),
(169, 1, 'เพิ่มคลื่นเสียงที่ 129', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:56:21'),
(170, 1, 'เพิ่มคลื่นเสียงที่ 130', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:56:54'),
(171, 1, 'เพิ่มคลื่นเสียงที่ 131', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 17:59:59'),
(172, 1, 'เพิ่มคลื่นเสียงที่ 132', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:11:10'),
(173, 1, 'เพิ่มคลื่นเสียงที่ 133', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:14:49'),
(174, 1, 'เพิ่มคลื่นเสียงที่ 134', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:15:47'),
(175, 1, 'เพิ่มคลื่นเสียงที่ 135', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:16:14'),
(176, 1, 'เพิ่มคลื่นเสียงที่ 136', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:19:06'),
(177, 1, 'เพิ่มคลื่นเสียงที่ 137', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:21:06'),
(178, 1, 'เพิ่มคลื่นเสียงที่ 138', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:22:03'),
(179, 1, 'เพิ่มคลื่นเสียงที่ 139', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:22:30'),
(180, 1, 'เพิ่มคลื่นเสียงที่ 140', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:22:53'),
(181, 1, 'เพิ่มคลื่นเสียงที่ 141', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:22:53'),
(182, 1, 'แก้ไขคลื่นเสียงที่ 141', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/141', '127.0.0.1', '2026-09-01 18:30:48'),
(183, 1, 'แก้ไขคลื่นเสียงที่ 141', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/141', '127.0.0.1', '2026-09-01 18:31:01'),
(184, 1, 'แก้ไขคลื่นเสียงที่ 141', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/141', '127.0.0.1', '2026-09-01 18:31:24'),
(185, 1, 'เพิ่มคลื่นเสียงที่ 142', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:33:21'),
(186, 1, 'เพิ่มคลื่นเสียงที่ 143', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:33:42'),
(187, 1, 'เพิ่มคลื่นเสียงที่ 144', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:34:16'),
(188, 1, 'เพิ่มคลื่นเสียงที่ 145', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-01 18:34:37'),
(189, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-09-05 20:14:10'),
(190, 1, 'เพิ่มเพลย์ลิสต์ที่ 2', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/playlist/save', '127.0.0.1', '2026-09-09 20:32:54'),
(191, 1, 'แก้ไขคลื่นเสียงเพลย์ลิสต์ที่ 2', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/playlist/update/2', '127.0.0.1', '2026-09-09 20:40:51'),
(192, 1, 'แก้ไขข้อมูลส่วนตัว', 'แก้ไขข้อมูล', 'http://127.0.0.1:8000/profile', '127.0.0.1', '2026-09-12 18:17:04'),
(193, 1, 'แก้ไขข้อมูลส่วนตัว', 'แก้ไขข้อมูล', 'http://127.0.0.1:8000/profile', '127.0.0.1', '2026-09-12 18:18:02'),
(194, 2, 'แก้ไขข้อมูลส่วนตัว', 'แก้ไขข้อมูล', 'http://127.0.0.1:8000/profile', '127.0.0.1', '2026-09-12 18:18:55'),
(195, 2, 'แก้ไขข้อมูลส่วนตัว', 'แก้ไขข้อมูล', 'http://127.0.0.1:8000/profile', '127.0.0.1', '2026-09-12 18:20:47'),
(196, 1, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-12 19:18:24'),
(197, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-12 19:18:36'),
(198, 1, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-12 19:18:42'),
(199, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-12 19:20:21'),
(200, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-12 19:20:24'),
(201, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-12 19:20:43'),
(202, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-12 19:20:45'),
(203, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-12 19:21:22'),
(204, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-13 13:51:35'),
(205, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 04:25:57'),
(206, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 09:12:08'),
(207, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 09:12:15'),
(208, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 10:39:11'),
(209, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 10:39:30'),
(210, 1, 'แก้ไขคลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save/1', '127.0.0.1', '2026-09-14 10:39:52'),
(211, 1, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 10:53:04'),
(212, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 10:53:22'),
(213, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 12:27:34'),
(214, 1, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 14:10:21'),
(215, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 14:10:29'),
(216, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 18:23:31'),
(217, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 18:23:38'),
(218, 1, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 18:24:48'),
(219, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 18:24:57'),
(220, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 19:22:56'),
(221, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 19:23:02'),
(222, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-09-14 19:23:12'),
(223, 1, 'In Active คลื่นเสียงที่ 2', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/2', '127.0.0.1', '2026-09-14 19:23:29'),
(224, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-09-14 19:23:42'),
(225, 1, 'Active คลื่นเสียงที่ 2', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/2', '127.0.0.1', '2026-09-14 19:23:45'),
(226, 1, 'In Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-09-14 19:26:04'),
(227, 1, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 19:26:32'),
(228, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 19:26:51'),
(229, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 19:50:12'),
(230, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 19:50:18'),
(231, 1, 'Active คลื่นเสียงที่ 1', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/del/1', '127.0.0.1', '2026-09-14 19:50:34'),
(232, 1, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 19:50:35'),
(233, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 19:50:41'),
(234, 2, 'ออกสู่ระบบ', 'Logout', 'http://127.0.0.1:8000/logout', '127.0.0.1', '2026-09-14 21:54:20'),
(235, 2, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-14 21:54:28'),
(236, 1, 'เข้าสู่ระบบ', 'Login', 'http://127.0.0.1:8000/login', '127.0.0.1', '2026-09-15 19:38:15'),
(237, 1, 'เพิ่มคลื่นเสียงที่ 146', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-15 21:29:57'),
(238, 1, 'เพิ่มคลื่นเสียงที่ 147', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-15 21:30:35'),
(239, 1, 'เพิ่มคลื่นเสียงที่ 148', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-15 21:31:13'),
(240, 1, 'เพิ่มคลื่นเสียงที่ 149', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-15 21:31:51'),
(241, 1, 'เพิ่มคลื่นเสียงที่ 150', 'จัดการคลื่นเสียง', 'http://127.0.0.1:8000/admin/music/save', '127.0.0.1', '2026-09-15 21:32:32');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '0001_01_01_000000_create_users_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `music`
--

CREATE TABLE `music` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `detail` mediumtext DEFAULT NULL,
  `duration` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `file_path` varchar(255) DEFAULT NULL,
  `play_count` int(11) NOT NULL DEFAULT 0,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `music`
--

INSERT INTO `music` (`id`, `name`, `image`, `detail`, `duration`, `created_at`, `updated_at`, `file_path`, `play_count`, `status`) VALUES
(1, 'Deep Sleep State', '1776631823_img.jpg', NULL, 128, '2026-04-19 18:36:05', '2026-09-15 21:22:32', '1776631823_audio.mp3', 0, 1),
(2, 'Dreamless Serenity and Renewal', '1776632235_img.jpg', NULL, 175, '2026-04-19 13:44:30', '2026-09-14 19:23:45', '1776632235_audio.mp3', 0, 1),
(3, 'Dreamless Sleep', '1776632345_img.jpg', NULL, 174, '2026-04-19 13:59:05', '2026-09-10 21:44:59', '1776632345_audio.mp3', 0, 1),
(4, 'Advanced Awareness, Contemplative Calm and Inner Sight', '1776637963_img.jpg', NULL, 175, '2026-04-19 15:32:43', '2026-09-15 20:27:56', '1776637963_audio.mp3', 0, 1),
(5, 'Delta Waves for Cortisol Levels Reduction', '1776638658_img.jpg', NULL, 126, '2026-04-19 15:44:18', '2026-09-04 16:23:33', '1776638658_audio.mp3', 0, 1),
(6, '0.5 Hz Deep Sleep', '1777494030_img.jpg', NULL, 128, '2026-04-29 20:13:36', '2026-04-29 20:20:31', '1777494030_audio.mp3', 0, 1),
(7, '1 Hz Drifting', '1777494068_img.jpg', NULL, 127, '2026-04-29 20:14:27', '2026-09-15 20:28:11', '1777494068_audio.mp3', 0, 1),
(8, '2 Hz Nightfall', '1777831879_img.jpg', NULL, 127, '2026-05-03 18:11:19', '2026-05-03 18:11:19', '1777831879_audio.mp3', 0, 1),
(9, '3 Hz Delta Flow', '1777831967_img.jpg', NULL, 121, '2026-05-03 18:12:47', '2026-05-03 18:12:47', '1777831967_audio.mp3', 0, 1),
(10, '4 Hz Lucid Sleep', '1777832740_img.jpg', NULL, 123, '2026-05-03 18:25:40', '2026-05-03 18:25:40', '1777832740_audio.mp3', 0, 1),
(11, 'Deep Sleep Talkdown with Delta Waves', '1777832908_img.jpg', NULL, 1832, '2026-05-03 18:28:28', '2026-05-03 18:28:28', '1777832908_audio.mp3', 0, 1),
(12, 'Delta Waves for Deep Sleep', '1777832959_img.jpg', NULL, 600, '2026-05-03 18:29:19', '2026-09-10 11:48:54', '1777832959_audio.mp3', 0, 1),
(13, 'Deep Sleep Music', '1777833008_img.jpg', NULL, 1830, '2026-05-03 18:30:08', '2026-05-03 18:30:08', '1777833008_audio.mp3', 0, 1),
(14, 'Fall Asleep', '1777833059_img.jpg', NULL, 1830, '2026-05-03 18:30:59', '2026-09-10 16:14:39', '1777833059_audio.mp3', 0, 1),
(15, 'Deep Sleep: Experience Uninterrupted Rest', '1777833100_img.jpg', NULL, 1830, '2026-05-03 18:31:40', '2026-09-14 20:46:41', '1777833100_audio.mp3', 0, 1),
(16, 'Slow Down Your Brainwaves', '1777833314_img.jpg', NULL, 911, '2026-05-03 18:35:14', '2026-05-03 18:35:14', '1777833314_audio.mp3', 0, 1),
(17, '15 Minutes - Power Nap', '1777833360_img.jpg', NULL, 942, '2026-05-03 18:36:00', '2026-09-10 16:18:27', '1777833360_audio.mp3', 0, 1),
(18, '20 Minutes - Power Nap', '1777833402_img.jpg', NULL, 1242, '2026-05-03 18:36:42', '2026-09-10 09:42:51', '1777833402_audio.mp3', 0, 1),
(19, 'Delta Waves for Deep Rest', '1777833469_img.jpg', NULL, 1830, '2026-05-03 18:37:49', '2026-05-03 18:37:49', '1777833469_audio.mp3', 0, 1),
(20, 'Relaxing Deep Sleep, Inner Peace', '1777836187_img.jpg', NULL, 2699, '2026-05-03 19:23:07', '2026-09-14 08:53:03', '1777836187_audio.mp3', 0, 1),
(21, 'Deep Sleep Release', '1778255132_img.jpg', NULL, 1830, '2026-05-08 15:45:32', '2026-09-10 09:54:30', '1778255132_audio.mp3', 0, 1),
(22, 'Where Sleep Floats', '1778255177_img.jpg', NULL, 208, '2026-05-08 15:46:17', '2026-05-08 15:46:17', '1778255177_audio.mp3', 0, 1),
(23, 'Cosmic Sleep', '1778255222_img.jpg', NULL, 134, '2026-05-08 15:47:02', '2026-05-08 15:47:02', '1778255222_audio.mp3', 0, 1),
(24, 'Above The Clouds', '1778255243_img.jpg', NULL, 136, '2026-05-08 15:47:23', '2026-05-08 15:47:23', '1778255243_audio.mp3', 0, 1),
(25, 'Falling Into Slumber', '1778255265_img.jpg', NULL, 138, '2026-05-08 15:47:45', '2026-05-08 15:47:45', '1778255265_audio.mp3', 0, 1),
(26, 'Sleep Beneath Waves', '1778255334_img.jpg', NULL, 127, '2026-05-08 15:48:54', '2026-09-10 09:49:21', '1778255334_audio.mp3', 0, 1),
(27, 'Lull', '1778255374_img.jpg', NULL, 148, '2026-05-08 15:49:34', '2026-09-10 09:49:13', '1778255374_audio.mp3', 0, 1),
(28, 'Theta Waves for Power Nap', '1778255404_img.jpg', NULL, 1801, '2026-05-08 15:50:04', '2026-05-08 15:50:04', '1778255404_audio.mp3', 0, 1),
(29, 'Deep Sleep, Breath of Night', '1778255442_img.jpg', NULL, 1830, '2026-05-08 15:50:42', '2026-05-08 15:50:42', '1778255442_audio.mp3', 0, 1),
(30, 'Night Flow', '1778255500_img.jpg', NULL, 1830, '2026-05-08 15:51:40', '2026-09-14 09:47:13', '1778255500_audio.mp3', 0, 1),
(31, '40 Hz Focus', '1778255870_img.jpg', NULL, 150, '2026-05-08 15:57:50', '2026-09-15 20:18:22', '1778255870_audio.mp3', 0, 1),
(32, '40 Hz Memory Recall', '1778255902_img.jpg', NULL, 127, '2026-05-08 15:58:22', '2026-09-15 20:01:44', '1778255902_audio.mp3', 0, 1),
(33, '40 Hz Calm The Mind', '1778255964_img.jpg', NULL, 90, '2026-05-08 15:59:24', '2026-09-15 20:49:00', '1778255964_audio.mp3', 0, 1),
(34, '40 Hz Help you Learning', '1778255989_img.jpg', NULL, 90, '2026-05-08 15:59:49', '2026-09-15 20:22:22', '1778255989_audio.mp3', 0, 1),
(35, '40 Hz Genius Brain', '1778256014_img.jpg', NULL, 90, '2026-05-08 16:00:14', '2026-09-15 20:22:52', '1778256014_audio.mp3', 0, 1),
(36, '40 Hz Study Music', '1778256040_img.jpg', NULL, 218, '2026-05-08 16:00:40', '2026-09-15 20:22:59', '1778256040_audio.mp3', 0, 1),
(37, '40 Hz Focus Frequency', '1778256066_img.jpg', NULL, 210, '2026-05-08 16:01:06', '2026-09-15 20:23:13', '1778256066_audio.mp3', 0, 1),
(38, '40 Hz Increase Productivity', '1778256084_img.jpg', NULL, 198, '2026-05-08 16:01:24', '2026-09-15 20:23:32', '1778256084_audio.mp3', 0, 1),
(39, '40 Hz Flow State Thinking', '1778256107_img.jpg', NULL, 225, '2026-05-08 16:01:47', '2026-05-08 16:01:47', '1778256107_audio.mp3', 0, 1),
(40, '40 Hz Concentration Music', '1778256135_img.jpg', NULL, 250, '2026-05-08 16:02:15', '2026-05-08 16:02:15', '1778256135_audio.mp3', 0, 1),
(41, 'Mental Peak', '1778256340_img.jpg', NULL, 142, '2026-05-08 16:05:40', '2026-05-08 16:05:40', '1778256340_audio.mp3', 0, 1),
(42, 'Awakened Mind', '1778256368_img.jpg', NULL, 124, '2026-05-08 16:06:08', '2026-05-08 16:06:08', '1778256368_audio.mp3', 0, 1),
(43, 'Clear Mind', '1778256406_img.jpg', NULL, 144, '2026-05-08 16:06:46', '2026-05-08 16:06:46', '1778256406_audio.mp3', 0, 1),
(44, 'Headspace', '1778256453_img.jpg', NULL, 136, '2026-05-08 16:07:33', '2026-09-03 22:00:46', '1778256453_audio.mp3', 0, 1),
(45, 'Peak Performance', '1778256492_img.jpg', NULL, 144, '2026-05-08 16:08:12', '2026-05-08 16:08:12', '1778256492_audio.mp3', 0, 1),
(46, 'Focus Fuel', '1778256522_img.jpg', NULL, 126, '2026-05-08 16:08:42', '2026-05-08 16:08:42', '1778256522_audio.mp3', 0, 1),
(47, 'Deep Working', '1778256564_img.jpg', NULL, 132, '2026-05-08 16:09:24', '2026-05-08 16:09:24', '1778256564_audio.mp3', 0, 1),
(48, 'Brain Power', '1778256586_img.jpg', NULL, 124, '2026-05-08 16:09:46', '2026-05-08 16:09:46', '1778256586_audio.mp3', 0, 1),
(49, 'In The Flow', '1778256648_img.jpg', NULL, 122, '2026-05-08 16:10:48', '2026-09-02 19:52:21', '1778256648_audio.mp3', 0, 1),
(50, 'Mind', '1778256712_img.jpg', NULL, 126, '2026-05-08 16:11:52', '2026-09-14 22:18:43', '1778256712_audio.mp3', 0, 1),
(51, 'Dreamlight', '1778260204_img.jpg', NULL, 1771, '2026-05-08 17:10:04', '2026-09-15 20:18:06', '1778260204_audio.mp3', 0, 1),
(52, 'Focus Flow', '1778260868_img.jpg', NULL, 1800, '2026-05-08 17:21:08', '2026-05-08 17:21:08', '1778260868_audio.mp3', 0, 1),
(53, 'Focus Session - Golden Hill', '1778260918_img.jpg', NULL, 1800, '2026-05-08 17:21:58', '2026-05-08 17:21:58', '1778260918_audio.mp3', 0, 1),
(54, 'Intense Focus', '1778261483_img.jpg', NULL, 1800, '2026-05-08 17:31:23', '2026-05-08 17:31:23', '1778261483_audio.mp3', 0, 1),
(55, 'Deep Focus - Casting Spells', '1778261540_img.jpg', NULL, 1800, '2026-05-08 17:32:20', '2026-05-08 17:32:20', '1778261540_audio.mp3', 0, 1),
(56, 'Morning Focus', '1778262490_img.jpg', NULL, 1771, '2026-05-08 17:48:10', '2026-05-08 17:48:10', '1778262490_audio.mp3', 0, 1),
(57, 'Focus Groovy - Productivity Music', '1778263512_img.jpg', NULL, 1837, '2026-05-08 17:48:42', '2026-05-08 18:05:12', '1778263512_audio.mp3', 0, 1),
(58, 'Pomodoro Deep Work Session', '1778265245_img.jpg', NULL, 1811, '2026-05-08 18:34:05', '2026-05-08 18:34:05', '1778265245_audio.mp3', 0, 1),
(59, 'Frequency for Focus, Memory, and Concentration', '1778265288_img.jpg', NULL, 1807, '2026-05-08 18:34:48', '2026-05-08 18:34:48', '1778265288_audio.mp3', 0, 1),
(60, 'Candle Hours - Focus Music', '1778265339_img.jpg', NULL, 1800, '2026-05-08 18:35:39', '2026-09-15 20:21:45', '1778265339_audio.mp3', 0, 1),
(61, 'Positive Aura Cleanse', '1788278249_img.jpg', NULL, 377, '2026-09-01 15:57:30', '2026-09-15 20:07:49', '1788278249_audio.mp3', 0, 1),
(62, 'Relaxing Music', '1788278437_img.jpg', NULL, 1218, '2026-09-01 16:00:37', '2026-09-15 19:40:42', '1788278437_audio.mp3', 0, 1),
(63, 'Weightless and Beyond', '1788278691_img.jpg', NULL, 489, '2026-09-01 16:04:51', '2026-09-15 20:23:45', '1788278691_audio.mp3', 0, 1),
(64, 'Mood & Energy Booster', '1788278804_img.jpg', NULL, 1210, '2026-09-01 16:06:44', '2026-09-01 16:06:44', '1788278804_audio.mp3', 0, 1),
(65, 'Morning Energy', '1788279022_img.jpg', NULL, 1794, '2026-09-01 16:10:22', '2026-09-01 16:10:22', '1788279022_audio.mp3', 0, 1),
(66, 'Fading Light', '1788279247_img.jpg', NULL, 189, '2026-09-01 16:14:07', '2026-09-04 16:19:41', '1788279247_audio.mp3', 0, 1),
(67, 'Flowers Blooming', '1788279278_img.jpg', NULL, 482, '2026-09-01 16:14:38', '2026-09-01 16:14:38', '1788279278_audio.mp3', 0, 1),
(68, 'Centering', '1788279493_img.jpg', NULL, 1203, '2026-09-01 16:18:13', '2026-09-01 16:18:13', '1788279493_audio.mp3', 0, 1),
(69, 'Mood Balance', '1788279558_img.jpg', NULL, 906, '2026-09-01 16:19:18', '2026-09-01 16:19:18', '1788279558_audio.mp3', 0, 1),
(70, 'Heartbeat', '1788279852_img.jpg', NULL, 189, '2026-09-01 16:24:12', '2026-09-01 16:24:12', '1788279852_audio.mp3', 0, 1),
(71, 'Day of the River', '1788280013_img.jpg', NULL, 188, '2026-09-01 16:26:53', '2026-09-15 20:13:14', '1788280013_audio.mp3', 0, 1),
(72, 'Mindful Souls', '1788280063_img.jpg', NULL, 191, '2026-09-01 16:27:43', '2026-09-01 16:27:43', '1788280063_audio.mp3', 0, 1),
(73, 'Calm Wind', '1788280115_img.jpg', NULL, 198, '2026-09-01 16:28:35', '2026-09-15 19:40:29', '1788280115_audio.mp3', 0, 1),
(74, 'Mind Music', '1788280807_img.jpg', NULL, 141, '2026-09-01 16:40:07', '2026-09-10 20:04:38', '1788280807_audio.mp3', 0, 1),
(75, 'Lazy Morning', '1788280853_img.jpg', NULL, 199, '2026-09-01 16:40:53', '2026-09-01 16:40:53', '1788280853_audio.mp3', 0, 1),
(76, 'Drifting', '1788281081_img.jpg', NULL, 198, '2026-09-01 16:44:41', '2026-09-01 16:44:41', '1788281081_audio.mp3', 0, 1),
(77, 'Bright New Day', '1788281131_img.jpg', NULL, 186, '2026-09-01 16:45:31', '2026-09-04 16:22:33', '1788281131_audio.mp3', 0, 1),
(78, 'Ancient Magic Cat', '1788281179_img.jpg', NULL, 185, '2026-09-01 16:46:19', '2026-09-01 16:46:19', '1788281179_audio.mp3', 0, 1),
(79, 'Silent Comfort', '1788281231_img.jpg', NULL, 185, '2026-09-01 16:47:11', '2026-09-01 16:47:11', '1788281231_audio.mp3', 0, 1),
(80, 'My Spring Day', '1788281268_img.jpg', NULL, 197, '2026-09-01 16:47:48', '2026-09-15 20:23:37', '1788281268_audio.mp3', 0, 1),
(81, 'Soft Purr Evening', '1788281797_img.jpg', NULL, 186, '2026-09-01 16:56:37', '2026-09-01 16:56:37', '1788281797_audio.mp3', 0, 1),
(82, 'Little Cat, Little Dream', '1788282095_img.jpg', NULL, 187, '2026-09-01 17:01:35', '2026-09-01 17:01:35', '1788282095_audio.mp3', 0, 1),
(83, 'Cherry Smile', '1788282137_img.jpg', NULL, 199, '2026-09-01 17:02:17', '2026-09-01 17:02:17', '1788282137_audio.mp3', 0, 1),
(84, 'Healing Flow', '1788282171_img.jpg', NULL, 187, '2026-09-01 17:02:51', '2026-09-01 17:02:51', '1788282171_audio.mp3', 0, 1),
(85, 'Everlasting Peace', '1788282208_img.jpg', NULL, 185, '2026-09-01 17:03:28', '2026-09-01 17:03:28', '1788282208_audio.mp3', 0, 1),
(86, 'Aroma Bliss', '1788282383_img.jpg', NULL, 189, '2026-09-01 17:06:23', '2026-09-01 17:06:23', '1788282383_audio.mp3', 0, 1),
(87, 'Good Mood Booster', '1788282446_img.jpg', NULL, 1766, '2026-09-01 17:07:26', '2026-09-01 17:07:26', '1788282446_audio.mp3', 0, 1),
(88, 'Midday Energy Boost', '1788282566_img.jpg', NULL, 1330, '2026-09-01 17:09:26', '2026-09-01 17:09:26', '1788282566_audio.mp3', 0, 1),
(89, 'Subliminal Energy Booster', '1788282645_img.jpg', NULL, 1800, '2026-09-01 17:10:45', '2026-09-15 19:47:29', '1788282645_audio.mp3', 0, 1),
(90, 'Brain Booster, Increase Alertness', '1788282694_img.jpg', NULL, 1813, '2026-09-01 17:11:34', '2026-09-09 22:31:12', '1788282694_audio.mp3', 0, 1),
(91, 'Serenade of the Stream', '1788283039_img.jpg', NULL, 183, '2026-09-01 17:17:19', '2026-09-09 22:31:34', '1788283039_audio.mp3', 0, 1),
(92, 'Liora', '1788283517_img.jpg', NULL, 202, '2026-09-01 17:25:17', '2026-09-09 22:30:32', '1788283517_audio.mp3', 0, 1),
(93, 'Infinite Softness', '1788283550_img.jpg', NULL, 184, '2026-09-01 17:25:50', '2026-09-01 17:25:50', '1788283550_audio.mp3', 0, 1),
(94, 'Wind Story', '1788283597_img.jpg', NULL, 184, '2026-09-01 17:26:37', '2026-09-01 17:26:37', '1788283597_audio.mp3', 0, 1),
(95, 'Aether Light', '1788283625_img.jpg', NULL, 189, '2026-09-01 17:27:05', '2026-09-01 17:27:05', '1788283625_audio.mp3', 0, 1),
(96, 'Soft Interval', '1788283773_img.jpg', NULL, 201, '2026-09-01 17:29:33', '2026-09-01 17:29:33', '1788283773_audio.mp3', 0, 1),
(97, 'Velvet Echo', '1788283797_img.jpg', NULL, 192, '2026-09-01 17:29:57', '2026-09-01 17:29:57', '1788283797_audio.mp3', 0, 1),
(98, 'Endless Ease', '1788283829_img.jpg', NULL, 180, '2026-09-01 17:30:29', '2026-09-01 17:30:29', '1788283829_audio.mp3', 0, 1),
(99, 'Silent Comfort', '1788283856_img.jpg', NULL, 185, '2026-09-01 17:30:56', '2026-09-01 17:30:56', '1788283856_audio.mp3', 0, 1),
(100, 'Cat In Nocturne', '1788283893_img.jpg', NULL, 190, '2026-09-01 17:31:33', '2026-09-01 17:31:33', '1788283893_audio.mp3', 0, 1),
(101, 'Energy Vibration & Spiritual', '1788284050_img.jpg', NULL, 610, '2026-09-01 17:34:10', '2026-09-01 17:34:10', '1788284050_audio.mp3', 0, 1),
(102, 'Deep Meditation Connect to Higher Self', '1788284082_img.jpg', NULL, 1220, '2026-09-01 17:34:42', '2026-09-01 17:34:42', '1788284082_audio.mp3', 0, 1),
(103, 'Raise Your Energy', '1788284235_img.jpg', NULL, 1220, '2026-09-01 17:37:15', '2026-09-01 17:37:15', '1788284235_audio.mp3', 0, 1),
(104, 'Breathe and Stay', '1788284260_img.jpg', NULL, 182, '2026-09-01 17:37:40', '2026-09-01 17:37:40', '1788284260_audio.mp3', 0, 1),
(105, 'Let It Be Soft', '1788284289_img.jpg', NULL, 183, '2026-09-01 17:38:09', '2026-09-01 17:38:09', '1788284289_audio.mp3', 0, 1),
(106, 'Vibrational Shift', '1788284358_img.jpg', NULL, 899, '2026-09-01 17:39:18', '2026-09-01 17:39:18', '1788284358_audio.mp3', 0, 1),
(107, 'Free Yourself', '1788284429_img.jpg', NULL, 899, '2026-09-01 17:40:29', '2026-09-01 17:40:29', '1788284429_audio.mp3', 0, 1),
(108, 'Manifestation', '1788284454_img.jpg', NULL, 899, '2026-09-01 17:40:54', '2026-09-01 17:40:54', '1788284454_audio.mp3', 0, 1),
(109, 'Positive Energy Meditation', '1788284482_img.jpg', NULL, 895, '2026-09-01 17:41:22', '2026-09-01 17:41:22', '1788284482_audio.mp3', 0, 1),
(110, 'Relaxation', '1788284507_img.jpg', NULL, 888, '2026-09-01 17:41:47', '2026-09-01 17:41:47', '1788284507_audio.mp3', 0, 1),
(111, 'Mind & Body Balance', '1788284599_img.jpg', NULL, 899, '2026-09-01 17:43:19', '2026-09-01 17:43:19', '1788284599_audio.mp3', 0, 1),
(112, 'Mind & Body Sync', '1788284632_img.jpg', NULL, 1799, '2026-09-01 17:43:52', '2026-09-01 17:43:52', '1788284632_audio.mp3', 0, 1),
(113, 'Positive Vibrations', '1788284700_img.jpg', NULL, 650, '2026-09-01 17:45:00', '2026-09-05 22:59:13', '1788284700_audio.mp3', 0, 1),
(114, 'Alpha Pure Waves', '1788284730_img.jpg', NULL, 628, '2026-09-01 17:45:30', '2026-09-01 17:45:30', '1788284730_audio.mp3', 0, 1),
(115, 'Deep Alpha Binaural Beats', '1788284775_img.jpg', NULL, 910, '2026-09-01 17:46:15', '2026-09-15 19:40:51', '1788284775_audio.mp3', 0, 1),
(116, 'Relax Meditation Music', '1788284904_img.jpg', NULL, 606, '2026-09-01 17:48:24', '2026-09-01 17:48:24', '1788284904_audio.mp3', 0, 1),
(117, 'Healing Frequency', '1788284933_img.jpg', NULL, 610, '2026-09-01 17:48:53', '2026-09-01 17:48:53', '1788284933_audio.mp3', 0, 1),
(118, 'Enhanced', '1788284965_img.jpg', NULL, 150, '2026-09-01 17:49:25', '2026-09-01 17:49:25', '1788284965_audio.mp3', 0, 1),
(119, 'Meditation Oasis', '1788284995_img.jpg', NULL, 340, '2026-09-01 17:49:55', '2026-09-15 20:24:18', '1788284995_audio.mp3', 0, 1),
(120, 'Alpha Pure Calm', '1788285031_img.jpg', NULL, 1202, '2026-09-01 17:50:31', '2026-09-15 20:24:06', '1788285031_audio.mp3', 0, 1),
(121, 'Static Calming', '1788285144_img.jpg', NULL, 124, '2026-09-01 17:52:24', '2026-09-07 18:34:22', '1788285144_audio.mp3', 0, 1),
(122, 'Brain Training', '1788285163_img.jpg', NULL, 144, '2026-09-01 17:52:43', '2026-09-08 18:02:48', '1788285163_audio.mp3', 0, 1),
(123, 'Calm', '1788285186_img.jpg', NULL, 123, '2026-09-01 17:53:06', '2026-09-06 17:49:35', '1788285186_audio.mp3', 0, 1),
(124, 'Soft Trance', '1788285207_img.jpg', NULL, 139, '2026-09-01 17:53:27', '2026-09-01 17:53:27', '1788285207_audio.mp3', 0, 1),
(125, 'Calm and Soothing', '1788285234_img.jpg', NULL, 148, '2026-09-01 17:53:54', '2026-09-01 17:53:54', '1788285234_audio.mp3', 0, 1),
(126, 'Feel Refreshed', '1788285312_img.jpg', NULL, 149, '2026-09-01 17:55:12', '2026-09-01 17:55:12', '1788285312_audio.mp3', 0, 1),
(127, 'Stress Relief', '1788285337_img.jpg', NULL, 113, '2026-09-01 17:55:37', '2026-09-01 17:55:37', '1788285337_audio.mp3', 0, 1),
(128, 'Alpha Waves Mind Fields', '1788285356_img.jpg', NULL, 240, '2026-09-01 17:55:56', '2026-09-10 16:28:27', '1788285356_audio.mp3', 0, 1),
(129, 'Alpha State', '1788285381_img.jpg', NULL, 198, '2026-09-01 17:56:21', '2026-09-01 17:56:21', '1788285381_audio.mp3', 0, 1),
(130, 'Alpha - Relaxed Flow', '1788285414_img.jpg', NULL, 126, '2026-09-01 17:56:54', '2026-09-01 17:56:54', '1788285414_audio.mp3', 0, 1),
(131, 'Anxiety Relief Frequency', '1788285599_img.jpg', NULL, 1342, '2026-09-01 17:59:59', '2026-09-01 17:59:59', '1788285599_audio.mp3', 0, 1),
(132, 'Melt Away Anxiety & Stress', '1788286270_img.jpg', NULL, 2755, '2026-09-01 18:11:10', '2026-09-01 18:11:10', '1788286270_audio.mp3', 0, 1),
(133, 'Serotonin Release', '1788286489_img.jpg', NULL, 92, '2026-09-01 18:14:49', '2026-09-01 18:14:49', '1788286489_audio.mp3', 0, 1),
(134, 'Positivity', '1788286547_img.jpg', NULL, 93, '2026-09-01 18:15:47', '2026-09-01 18:15:47', '1788286547_audio.mp3', 0, 1),
(135, 'Blissful Breathe', '1788286574_img.jpg', NULL, 160, '2026-09-01 18:16:14', '2026-09-01 18:16:14', '1788286574_audio.mp3', 0, 1),
(136, 'Alpha Waves to Relieve Stress', '1788286746_img.jpg', NULL, 2117, '2026-09-01 18:19:06', '2026-09-01 18:19:06', '1788286746_audio.mp3', 0, 1),
(137, 'Body and Mind', '1788286866_img.jpg', NULL, 1121, '2026-09-01 18:21:06', '2026-09-01 18:21:06', '1788286866_audio.mp3', 0, 1),
(138, 'Alpha Waves for Serotonin & Endorphins', '1788286923_img.jpg', NULL, 1800, '2026-09-01 18:22:03', '2026-09-01 18:22:03', '1788286923_audio.mp3', 0, 1),
(139, 'Stress Reduction', '1788286950_img.jpg', NULL, 125, '2026-09-01 18:22:30', '2026-09-01 18:22:30', '1788286950_audio.mp3', 0, 1),
(140, 'In This Moment, I Am', '1788286973_img.jpg', NULL, 170, '2026-09-01 18:22:53', '2026-09-01 18:22:53', '1788286973_audio.mp3', 0, 1),
(141, 'Free', '1788287448_img.jpg', NULL, 144, '2026-09-01 18:22:53', '2026-09-01 18:30:48', '1788287448_audio.mp3', 0, 1),
(142, 'Another Calm', '1788287601_img.jpg', NULL, 146, '2026-09-01 18:33:21', '2026-09-01 18:33:21', '1788287601_audio.mp3', 0, 1),
(143, 'Present', '1788287622_img.jpg', NULL, 149, '2026-09-01 18:33:42', '2026-09-10 16:37:29', '1788287622_audio.mp3', 0, 1),
(144, 'Grounded', '1788287656_img.jpg', NULL, 163, '2026-09-01 18:34:16', '2026-09-01 18:34:16', '1788287656_audio.mp3', 0, 1),
(145, 'Eternal', '1788287677_img.jpg', NULL, 154, '2026-09-01 18:34:37', '2026-09-01 18:34:37', '1788287677_audio.mp3', 0, 1),
(146, 'Infinite', '1789507797_img.jpg', NULL, 191, '2026-09-15 21:29:57', '2026-09-15 21:29:57', '1789507797_audio.mp3', 0, 1),
(147, 'Enough', '1789507835_img.jpg', NULL, 199, '2026-09-15 21:30:35', '2026-09-15 21:30:35', '1789507835_audio.mp3', 0, 1),
(148, '15 Minutes - Mind Soothing', '1789507873_img.jpg', NULL, 896, '2026-09-15 21:31:13', '2026-09-15 21:31:13', '1789507873_audio.mp3', 0, 1),
(149, '30 Minutes - Subconscious Mind', '1789507911_img.jpg', NULL, 1799, '2026-09-15 21:31:51', '2026-09-15 21:31:51', '1789507911_audio.mp3', 0, 1),
(150, 'Stress Relief Meditation', '1789507952_img.jpg', NULL, 1799, '2026-09-15 21:32:32', '2026-09-15 21:32:32', '1789507952_audio.mp3', 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `playlist`
--

CREATE TABLE `playlist` (
  `id` int(11) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `detail` mediumtext DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `playlist_detail`
--

CREATE TABLE `playlist_detail` (
  `id` int(11) NOT NULL,
  `playlistid` int(11) DEFAULT NULL,
  `musicid` int(11) DEFAULT NULL,
  `playlist_order` int(11) DEFAULT NULL,
  `add_date` datetime DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` longtext NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('oVS7SrGvHdOuS9VZSenzOhn33hGY9tJVIsH8FiZs', 1, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/153.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoidE1rOWJvenNic09PQk5nN2FCZVVLT3hNZ2ZsQTdiTWVrdHpZeFh0ayI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mzc6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9hZG1pbi9tdXNpYy9kZWYiO3M6NToicm91dGUiO3M6OToibXVzaWMuZGVmIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6MTt9', 1789507956);

-- --------------------------------------------------------

--
-- Table structure for table `uig`
--

CREATE TABLE `uig` (
  `id` int(11) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `ugid` int(11) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `uig`
--

INSERT INTO `uig` (`id`, `uid`, `ugid`, `status`) VALUES
(1, 1, 1, NULL),
(2, 2, 2, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `password` varchar(255) DEFAULT NULL,
  `name` varchar(100) DEFAULT NULL,
  `surname` varchar(100) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `birthdate` date DEFAULT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `usertype` varchar(50) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id`, `password`, `name`, `surname`, `email`, `birthdate`, `gender`, `usertype`, `status`) VALUES
(1, '$2y$12$4cBsaMVQDMLWGj7bSgE3AOuIVahY50x3iRaITw1mvigprAjcVkMYS', 'SuperAdmin', 'pichan', '665041901208@mail.rmutk.ac.th', '2026-04-09', 'male', 'SuperAdmin', 1),
(2, '$2y$12$x7xahR7xi57opjwMspetNeo9Z2Fd4UNcHfyyFiJ2gPL3165YQuUvW', 'earth', 'Klawiset', 'earthzahub01@gmail.com', '2026-09-03', 'male', 'user', 1);

-- --------------------------------------------------------

--
-- Table structure for table `usergroup`
--

CREATE TABLE `usergroup` (
  `id` int(11) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `detail` varchar(50) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `usergroup`
--

INSERT INTO `usergroup` (`id`, `name`, `detail`, `status`) VALUES
(1, 'SuperAdmin', 'ทำงาน', 1),
(2, 'user', 'สมาชิกในระบบ', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `acl`
--
ALTER TABLE `acl`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `ugid` (`ugid`),
  ADD KEY `appid` (`appid`);

--
-- Indexes for table `application`
--
ALTER TABLE `application`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `assessment`
--
ALTER TABLE `assessment`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `uid` (`uid`);

--
-- Indexes for table `assessment_detail`
--
ALTER TABLE `assessment_detail`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `assessid` (`assessid`),
  ADD KEY `historyid` (`historyid`);

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `cat_detail`
--
ALTER TABLE `cat_detail`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `cat_music`
--
ALTER TABLE `cat_music`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `history`
--
ALTER TABLE `history`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `uid` (`uid`),
  ADD KEY `musicid` (`musicid`);

--
-- Indexes for table `log`
--
ALTER TABLE `log`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `uid` (`uid`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `music`
--
ALTER TABLE `music`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `playlist`
--
ALTER TABLE `playlist`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `uid` (`uid`);

--
-- Indexes for table `playlist_detail`
--
ALTER TABLE `playlist_detail`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `musicid` (`musicid`),
  ADD KEY `playlistid` (`playlistid`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Indexes for table `uig`
--
ALTER TABLE `uig`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD KEY `uid` (`uid`),
  ADD KEY `ugid` (`ugid`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `usergroup`
--
ALTER TABLE `usergroup`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `acl`
--
ALTER TABLE `acl`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `application`
--
ALTER TABLE `application`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `assessment`
--
ALTER TABLE `assessment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `assessment_detail`
--
ALTER TABLE `assessment_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `cat_detail`
--
ALTER TABLE `cat_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `cat_music`
--
ALTER TABLE `cat_music`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=346;

--
-- AUTO_INCREMENT for table `history`
--
ALTER TABLE `history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `log`
--
ALTER TABLE `log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=242;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `music`
--
ALTER TABLE `music`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;

--
-- AUTO_INCREMENT for table `playlist`
--
ALTER TABLE `playlist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `playlist_detail`
--
ALTER TABLE `playlist_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `uig`
--
ALTER TABLE `uig`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `usergroup`
--
ALTER TABLE `usergroup`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `acl`
--
ALTER TABLE `acl`
  ADD CONSTRAINT `acl_ibfk_1` FOREIGN KEY (`ugid`) REFERENCES `usergroup` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `acl_ibfk_2` FOREIGN KEY (`appid`) REFERENCES `application` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `assessment`
--
ALTER TABLE `assessment`
  ADD CONSTRAINT `assessment_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `assessment_detail`
--
ALTER TABLE `assessment_detail`
  ADD CONSTRAINT `assessment_detail_ibfk_1` FOREIGN KEY (`assessid`) REFERENCES `assessment` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `assessment_detail_ibfk_2` FOREIGN KEY (`historyid`) REFERENCES `history` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `history`
--
ALTER TABLE `history`
  ADD CONSTRAINT `history_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `history_ibfk_2` FOREIGN KEY (`musicid`) REFERENCES `music` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `log`
--
ALTER TABLE `log`
  ADD CONSTRAINT `log_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `playlist`
--
ALTER TABLE `playlist`
  ADD CONSTRAINT `playlist_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `playlist_detail`
--
ALTER TABLE `playlist_detail`
  ADD CONSTRAINT `playlist_detail_ibfk_1` FOREIGN KEY (`musicid`) REFERENCES `music` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `playlist_detail_ibfk_2` FOREIGN KEY (`playlistid`) REFERENCES `playlist` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `uig`
--
ALTER TABLE `uig`
  ADD CONSTRAINT `uig_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `uig_ibfk_2` FOREIGN KEY (`ugid`) REFERENCES `usergroup` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
